---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures
source: html/5aabd0a2-ad24-2456-c163-68bd06914073.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures

Failures about SlabShape.

## Syntax (C#)
```csharp
public static class SlabShapeFailures
```